# https://dev-yakuza.posstree.com/ko/environment/configure-development-environment-on-mac-with-homebrew-and-shell-script/
# == Install
# brew bundle --file=./Brewfile
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "ack"
brew "ansible"
brew "as-tree"
brew "bottom"
brew "bpytop"
brew "duf"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "grex"
brew "htop"
brew "mas"
brew "neovim"
brew "poetry"
brew "procs"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "sd"
brew "sqlite"
brew "tldr"
brew "tmux"
brew "tree"
brew "virtualenv", link: false
brew "wget"
brew "yq"
brew "zoxide"
cask "calibre"
cask "visual-studio-code"
cask "wezterm"
cask "iterm2"
cask "sequel-pro"
cask "db-browser-for-sqlite"
